# Класс Color
# Для кодирования цвета часто используется шестнадцатеричное значение цвета. Оно записывается в формате #RRGGBB, где RR (красный), GG (зеленый) и BB (синий) являются шестнадцатеричными целыми числами в диапазоне [00; FF] (или [0; 255] в десятичной системе счисления), которые указывают интенсивность соответствующих цветов. Например, #0000FF представляет чистый синий цвет, так как синий компонент имеет наивысшее значение (FF), а остальные — 00.
#
# Реализуйте класс Color, описывающий цвет. При создании экземпляра класс должен принимать один аргумент:
#
# hexcode — шестнадцатеричное значение цвета
# Экземпляр класса Color должен иметь три атрибута:
#
# r — интенсивность красного компонента цвета в виде десятичного числа
# g — интенсивность зеленого компонента цвета в виде десятичного числа
# b — интенсивность синего компонента цвета в виде десятичного числа
# Класс Color должен иметь одно свойство:
#
# hexcode — свойство, доступное для чтения и записи, возвращающее шестнадцатеричное значение цвета
# Примечание 1. При изменении шестнадцатеричного значения цвета значения атрибутов r, g и b также должны изменяться.
#
# Примечание 2. Гарантируется, что для записи шестнадцатеричных чисел используются только заглавные латинские буквы.
#
# Примечание 3. Дополнительная проверка данных на корректность не требуется. Гарантируется, что реализованный класс используется только с корректными данными.
#
# Примечание 4. Никаких ограничений касательно реализации класса Color нет, она может быть произвольной.

class Color:
    def __init__(self, hexcode):
        self._r = hexcode[:2]
        self._g = hexcode[2:4]
        self._b = hexcode[4:]

    @property
    def r(self):
        return int(self._r, 16)

    @property
    def g(self):
        return int(self._g, 16)

    @property
    def b(self):
        return int(self._b, 16)

    @property
    def hexcode(self):
        return f'{self._r}{self._g}{self._b}'

    @hexcode.setter
    def hexcode(self, new_hexcode):
        self._r = new_hexcode[:2]
        self._g = new_hexcode[2:4]
        self._b = new_hexcode[4:]


color = Color('0000FF')

color.hexcode = 'A782E3'
print(color.hexcode)
print(color.r)
print(color.g)
print(color.b)






